Repository: prasanthrangan/dotfiles
Catalog: Configs/plasma/.local/share/plasma/plasmoids/com.pajuelo.plasmaConfSaver/translate/*.po
Languages: hr, tr, zh

source: Enter customization title
hr: Unesite naziv prilagodbe
tr: Şablonlarınızda arayın...
zh: 自定义配置名称

source: Save
hr: Spremi
tr: Kaydet
zh: 保存

source: Save your current customization
hr: Spremi trenutne promjene
tr: Mevcut masaüstü şablonunuzu kaydedin
zh: 保存当前自定义配置

source: Import
hr: Uvezi
tr: İçe Aktar
zh: 导入

source: Import a customization
hr: Uvezi prilagodbu
tr: Bir masaüstü şablonunu içe aktarın
zh: 导入已保存的配置

source: Load
hr: Uitaj
tr: Yükle
zh: 读取

source: Load this customization
hr: Uitaj ovu prilagodbu
tr: Bu masaüstü şablonunu yükleyin
zh: 读取此配置

source: Update
tr: Güncelle
zh: 更新

source: Save this customization again
tr: Bu masaüstü şablonunu yeniden kaydedin
zh: 再次保存此配置

source: Export
hr: Izvezi
tr: Dışa Aktar
zh: 导出

source: Export this customization
hr: Izvezi ovu prilagodbu
tr: Bu masaüstü şablonunu dışa aktarın
zh: 导出此配置

source: Delete
hr: Ukloni
tr: Sil
zh: 删除

source: Delete this customization
hr: Ukloni ovu prilagodbu
tr: Bu masaüstü şablonunu silin
zh: 删除此配置
