{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v3.6.0", "signature": {"inputs": {"adjacency:0": {"name": "adjacency:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "50"}, {"size": "50"}]}}, "features:0": {"name": "features:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "50"}, {"size": "638"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "adjacency", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "50"}, {"size": "50"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "features", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "50"}, {"size": "638"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input_control_node/_0", "op": "NoOp", "input": ["^adjacency", "^features"]}, {"name": "Func/StatefulPartitionedCall/input/_17", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_18", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/axes", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_15", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/Reshape_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/Reshape_4", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_11", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/Reshape_7", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/Reshape/shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/Reshape_10", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv/Reshape_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "638"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv/Reshape_4", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "638"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_5", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_1", "op": "Identity", "input": ["adjacency", "^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv/Reshape_7", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "638"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model/arma_conv/Reshape/shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/arma_conv/Reshape_10", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "638"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model/arma_conv/Shape", "op": "Shape", "input": ["features", "^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_8", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/Reshape_2/shape/1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/Reshape_2/shape/2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_14", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv/Mean/reduction_indices", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/free", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/Const_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/concat/axis", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "Func/StatefulPartitionedCall/input/_16", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/global_attention_pool/Sum/reduction_indices", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_19", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "128"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_20", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_21", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "2"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_22", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/arma_conv/Reshape", "op": "Reshape", "input": ["features", "StatefulPartitionedCall/model/arma_conv/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/arma_conv/unstack", "op": "Unpack", "input": ["StatefulPartitionedCall/model/arma_conv/Shape"], "attr": {"num": {"i": "3"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/arma_conv/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model/arma_conv/Reshape", "StatefulPartitionedCall/model/arma_conv/Reshape_1"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv/MatMul_2", "op": "MatMul", "input": ["StatefulPartitionedCall/model/arma_conv/Reshape", "StatefulPartitionedCall/model/arma_conv/Reshape_4"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/model/arma_conv/MatMul_3", "op": "MatMul", "input": ["StatefulPartitionedCall/model/arma_conv/Reshape", "StatefulPartitionedCall/model/arma_conv/Reshape_7"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv/MatMul_5", "op": "MatMul", "input": ["StatefulPartitionedCall/model/arma_conv/Reshape", "StatefulPartitionedCall/model/arma_conv/Reshape_10"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv/Reshape_2/shape", "op": "Pack", "input": ["StatefulPartitionedCall/model/arma_conv/unstack", "StatefulPartitionedCall/model/arma_conv_1/Reshape_2/shape/1", "StatefulPartitionedCall/model/arma_conv_1/Reshape_2/shape/2"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "3"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/arma_conv/Reshape_2", "op": "Reshape", "input": ["StatefulPartitionedCall/model/arma_conv/MatMul", "StatefulPartitionedCall/model/arma_conv/Reshape_2/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv/Reshape_5", "op": "Reshape", "input": ["StatefulPartitionedCall/model/arma_conv/MatMul_2", "StatefulPartitionedCall/model/arma_conv/Reshape_2/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/arma_conv/Reshape_8", "op": "Reshape", "input": ["StatefulPartitionedCall/model/arma_conv/MatMul_3", "StatefulPartitionedCall/model/arma_conv/Reshape_2/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/arma_conv/Reshape_11", "op": "Reshape", "input": ["StatefulPartitionedCall/model/arma_conv/MatMul_5", "StatefulPartitionedCall/model/arma_conv/Reshape_2/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/arma_conv/MatMul_1", "op": "BatchMatMulV2", "input": ["Func/StatefulPartitionedCall/input/_1", "StatefulPartitionedCall/model/arma_conv/Reshape_2"], "attr": {"adj_x": {"b": false}, "adj_y": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv/MatMul_4", "op": "BatchMatMulV2", "input": ["Func/StatefulPartitionedCall/input/_1", "StatefulPartitionedCall/model/arma_conv/Reshape_8"], "attr": {"adj_x": {"b": false}, "adj_y": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/arma_conv/MatMul_1", "StatefulPartitionedCall/model/arma_conv/Reshape_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model/arma_conv/MatMul_4", "StatefulPartitionedCall/model/arma_conv/Reshape_11"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/arma_conv/add", "Func/StatefulPartitionedCall/input/_5"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model/arma_conv/BiasAdd_1", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/arma_conv/add_1", "Func/StatefulPartitionedCall/input/_8"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/arma_conv/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv/Relu_1", "op": "Relu", "input": ["StatefulPartitionedCall/model/arma_conv/BiasAdd_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model/arma_conv/Relu", "StatefulPartitionedCall/model/arma_conv/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "axis": {"i": "-1"}}}, {"name": "StatefulPartitionedCall/model/arma_conv/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model/arma_conv/stack", "StatefulPartitionedCall/model/arma_conv/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/arma_conv/Relu_2", "op": "Relu", "input": ["StatefulPartitionedCall/model/arma_conv/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model/arma_conv/Relu_2", "StatefulPartitionedCall/model/arma_conv_1/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/arma_conv/Relu_2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model/arma_conv_1/Reshape", "StatefulPartitionedCall/model/arma_conv_1/Reshape_1"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/MatMul_2", "op": "MatMul", "input": ["StatefulPartitionedCall/model/arma_conv_1/Reshape", "StatefulPartitionedCall/model/arma_conv_1/Reshape_4"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/MatMul_3", "op": "MatMul", "input": ["StatefulPartitionedCall/model/arma_conv_1/Reshape", "StatefulPartitionedCall/model/arma_conv_1/Reshape_7"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/MatMul_5", "op": "MatMul", "input": ["StatefulPartitionedCall/model/arma_conv_1/Reshape", "StatefulPartitionedCall/model/arma_conv_1/Reshape_10"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/unstack", "op": "Unpack", "input": ["StatefulPartitionedCall/model/arma_conv_1/Shape"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "num": {"i": "3"}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/Reshape_2/shape", "op": "Pack", "input": ["StatefulPartitionedCall/model/arma_conv_1/unstack", "StatefulPartitionedCall/model/arma_conv_1/Reshape_2/shape/1", "StatefulPartitionedCall/model/arma_conv_1/Reshape_2/shape/2"], "attr": {"axis": {"i": "0"}, "N": {"i": "3"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/Reshape_2", "op": "Reshape", "input": ["StatefulPartitionedCall/model/arma_conv_1/MatMul", "StatefulPartitionedCall/model/arma_conv_1/Reshape_2/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/Reshape_5", "op": "Reshape", "input": ["StatefulPartitionedCall/model/arma_conv_1/MatMul_2", "StatefulPartitionedCall/model/arma_conv_1/Reshape_2/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/Reshape_8", "op": "Reshape", "input": ["StatefulPartitionedCall/model/arma_conv_1/MatMul_3", "StatefulPartitionedCall/model/arma_conv_1/Reshape_2/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/Reshape_11", "op": "Reshape", "input": ["StatefulPartitionedCall/model/arma_conv_1/MatMul_5", "StatefulPartitionedCall/model/arma_conv_1/Reshape_2/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/MatMul_1", "op": "BatchMatMulV2", "input": ["Func/StatefulPartitionedCall/input/_1", "StatefulPartitionedCall/model/arma_conv_1/Reshape_2"], "attr": {"adj_x": {"b": false}, "adj_y": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/MatMul_4", "op": "BatchMatMulV2", "input": ["Func/StatefulPartitionedCall/input/_1", "StatefulPartitionedCall/model/arma_conv_1/Reshape_8"], "attr": {"T": {"type": "DT_FLOAT"}, "adj_x": {"b": false}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/arma_conv_1/MatMul_1", "StatefulPartitionedCall/model/arma_conv_1/Reshape_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model/arma_conv_1/MatMul_4", "StatefulPartitionedCall/model/arma_conv_1/Reshape_11"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/arma_conv_1/add", "Func/StatefulPartitionedCall/input/_11"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/BiasAdd_1", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/arma_conv_1/add_1", "Func/StatefulPartitionedCall/input/_14"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/arma_conv_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/Relu_1", "op": "Relu", "input": ["StatefulPartitionedCall/model/arma_conv_1/BiasAdd_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model/arma_conv_1/Relu", "StatefulPartitionedCall/model/arma_conv_1/Relu_1"], "attr": {"axis": {"i": "-1"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model/arma_conv_1/stack", "StatefulPartitionedCall/model/arma_conv/Mean/reduction_indices"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/arma_conv_1/Relu_2", "op": "Relu", "input": ["StatefulPartitionedCall/model/arma_conv_1/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/arma_conv_1/Relu_2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/Shape", "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/axes", "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/concat/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/Shape", "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/free", "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/concat/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/GatherV2_1", "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/GatherV2", "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/Const"], "attr": {"T": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/GatherV2", "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/Const_2", "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/Prod", "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model/arma_conv_1/Relu_2", "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/stack"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/global_attention_pool/attn_layer/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/Reshape", "Func/StatefulPartitionedCall/input/_17"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/Reshape", "Func/StatefulPartitionedCall/input/_15"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/global_attention_pool/attn_layer/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/model/global_attention_pool/attn_layer/Tensordot/MatMul", "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/MatMul", "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/concat_1"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/global_attention_pool/attn_layer/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/global_attention_pool/attn_layer/Tensordot", "Func/StatefulPartitionedCall/input/_18"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model/global_attention_pool/features_layer/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot", "Func/StatefulPartitionedCall/input/_16"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model/global_attention_pool/attn_layer/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/global_attention_pool/attn_layer/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/global_attention_pool/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/global_attention_pool/attn_layer/Sigmoid", "StatefulPartitionedCall/model/global_attention_pool/features_layer/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/global_attention_pool/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/model/global_attention_pool/mul", "StatefulPartitionedCall/model/global_attention_pool/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/global_attention_pool/Sum", "Func/StatefulPartitionedCall/input/_19", "Func/StatefulPartitionedCall/input/_20"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/model/prediction/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Relu", "Func/StatefulPartitionedCall/input/_21", "Func/StatefulPartitionedCall/input/_22"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/model/prediction/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/prediction/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model/prediction/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of1.dat"], "weights": [{"name": "Func/StatefulPartitionedCall/input/_17", "shape": [64, 64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_18", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_15", "shape": [64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/arma_conv_1/Reshape_1", "shape": [64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/arma_conv_1/Reshape_4", "shape": [64, 64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_11", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/arma_conv_1/Reshape_7", "shape": [64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/arma_conv_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/arma_conv_1/Reshape_10", "shape": [64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/arma_conv/Reshape_1", "shape": [638, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/arma_conv/Reshape_4", "shape": [638, 64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_5", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/arma_conv/Reshape_7", "shape": [638, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/arma_conv/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/arma_conv/Reshape_10", "shape": [638, 64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_8", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/arma_conv_1/Reshape_2/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/arma_conv_1/Reshape_2/shape/2", "shape": [], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_14", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/arma_conv/Mean/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/global_attention_pool/features_layer/Tensordot/concat/axis", "shape": [], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_16", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/global_attention_pool/Sum/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_19", "shape": [64, 128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_20", "shape": [128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_21", "shape": [128, 2], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_22", "shape": [2], "dtype": "float32"}]}]}