Repository: prasanthrangan/dotfiles
Catalog: Configs/.local/share/plasma/plasmoids/com.pajuelo.plasmaConfSaver/translate/*.po
Languages: da_dk, fr, id, it

source: Enter customization title
da_dk: Indtast navn til layoutændring
fr: Entrez le titre de la personnalisation
id: Masukan judul kustomisasi
it: Inserisci titolo della configurazione

source: Save
da_dk: Gem
fr: Sauvegarder
id: Simpan
it: Salva

source: Save your current customization
da_dk: Gem din nuværende layoutændring
fr: Sauvegardez votre personnalisation actuelle
id: Simpan kustomisasi
it: Salva la tua configurazione attuale

source: Import
da_dk: Importer
fr: Importer
id: Impor
it: Importa

source: Import a customization
da_dk: Importer en layoutændring
fr: Importer une personnalisation
id: Impor kustomisasi
it: Importa una configurazione

source: Load
da_dk: Indlæs
fr: Charger
id: Memuat
it: Carica

source: Load this customization
da_dk: Indlæs denne layoutændring
fr: Charger cette personnalisation
id: Memuat kustomisasi
it: Carica questa configurazione

source: Update
id: Simpan kustomisasi
it: Aggiorna

source: Save this customization again
id: Simpan kustomisasi lagi
it: Salva questa configurazione di nuovo

source: Export
da_dk: Eksporter
fr: Exporter
id: Ekspor
it: Esporta

source: Export this customization
da_dk: Eksporter denne layoutændring
fr: Exporter cette personnalisation
id: Ekspor kustomisasi
it: Esporta questa configurazione

source: Delete
da_dk: Slet
fr: Supprimer
id: Hapus
it: Cancella

source: Delete this customization
da_dk: Slet denne layoutændring
fr: Supprimer cette personnalisation
id: Hapus kustomisasi
it: Cancella questa configurazione
